Config/Documents/ЗаявлениеНаПолучениеДенежныхЧековыхКнижек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаПолучениеДенежныхЧековыхКнижек</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКнижек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДокументВыданКем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДокументВыданКогда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтерДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученыСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученыС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученыПо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученыДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ЗаявлениеНаПолучениеДенежныхЧековыхКнижек/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявлениеНаПолучениеДенежныхЧековыхКнижек";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек22н";
	КомандаПечати.Представление		= НСтр("ru = 'Заявление на получение чековых книжек (ф. 0531242)'");
	КомандаПечати.Порядок			= 1;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявлениеНаПолучениеДенежныхЧековыхКнижек";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Заявление на получение чековых книжек (ред. от 31.12.2010 № 199н)'");
	КомандаПечати.Порядок			= 100;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявлениеНаПолучениеДенежныхЧековыхКнижек";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек0531242";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Заявление на получение чековых книжек (ред. от 30.06.2014 г. N 10н)'");
	КомандаПечати.Порядок			= 100;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Проверяем, нужно ли для макета формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек22н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек22н",
			"Заявление на получение денежных чековых книжек",
			ПечатьЗаявления(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек22н"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек",
			"Заявление на получение денежных чековых книжек",
			ПечатьЗаявления(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек0531242") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек0531242",
			"Заявление на получение денежных чековых книжек",
			ПечатьЗаявления(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек0531242"));
	КонецЕсли;

КонецПроцедуры

// Функция формирует табличный документ 
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьЗаявления(МассивОбъектов, ОбъектыПечати, НомерФормы)
	Перем Месяцы;
	
	Месяцы = Новый Массив;
	Месяцы.Добавить("января");
	Месяцы.Добавить("февраля");
	Месяцы.Добавить("марта");
	Месяцы.Добавить("апреля");
	Месяцы.Добавить("мая");
	Месяцы.Добавить("июня");
	Месяцы.Добавить("июля");
	Месяцы.Добавить("августа");
	Месяцы.Добавить("сентября");
	Месяцы.Добавить("октября");
	Месяцы.Добавить("ноября");
	Месяцы.Добавить("декабря");	
	
	ТабДокумент 					= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаПолучениеДенежныхЧековыхКнижек";
	Макет 							= УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявлениеНаПолучениеДенежныхЧековыхКнижек." + НомерФормы);
	Обл   							= Макет.ПолучитьОбласть("Заявление");
		
	Обл.Параметры.Заполнить(МассивОбъектов[0]);
	Обл.Параметры.ПредставлениеОрганизации	= ?(МассивОбъектов[0].Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование,
												МассивОбъектов[0].Организация.НаименованиеСокращенное,
												МассивОбъектов[0].Организация.НаименованиеПолное);
	Обл.Параметры.Казначейство				= МассивОбъектов[0].ОрганКазначейства.НаименованиеПолное;
	Обл.Параметры.КодПоРПБС					= МассивОбъектов[0].Организация.КодПоРПБС;
	Обл.Параметры.ИНН						= МассивОбъектов[0].Организация.ИНН;
	Обл.Параметры.КОФК						= МассивОбъектов[0].ОрганКазначейства.Код;
	Обл.Параметры.День						= День(МассивОбъектов[0].Дата);
	Обл.Параметры.Месяц						= Месяцы[Месяц(МассивОбъектов[0].Дата) - 1];
	Обл.Параметры.Год						= Формат(Год(МассивОбъектов[0].Дата), "ЧГ=''");
	Обл.Параметры.КоличествоПрописью		= СокрЛП(ЧислоПрописью(МассивОбъектов[0].КоличествоКнижек, "Л=ru_RU", ",,,ж,,,ж,,0"));
	Обл.Параметры.ПредставлениеРаботника	= МассивОбъектов[0].ПолучательДолжность + ", " + Строка(МассивОбъектов[0].Получатель);
	Обл.Параметры.ДеньВыдачи				= День(МассивОбъектов[0].ПолучательДокументВыданКогда);
	Обл.Параметры.МесяцВыдачи				= Месяцы[Месяц(МассивОбъектов[0].ПолучательДокументВыданКогда) - 1];
	Обл.Параметры.ГодВыдачи					= Формат(Год(МассивОбъектов[0].ПолучательДокументВыданКогда), "ЧГ=''");
	Обл.Параметры.РуководительФИО			= Корреспонденты.ФИОПоОбъекту(Строка(МассивОбъектов[0].Руководитель), ИСТИНА);
	Обл.Параметры.ГлБухгалтерФИО			= Корреспонденты.ФИОПоОбъекту(Строка(МассивОбъектов[0].ГлБухгалтер), ИСТИНА);
	
	ТабДокумент.Вывести(Обл);
		
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, МассивОбъектов[0]);
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
